/** 1つの値のメモリサイズ */
const byteSize = 4

export const cubeVertexSize = byteSize * 8 // cubeVertexArray内の各頂点ごとのスキップサイズ、頂点座標とカラー値を合わせて8個
export const cubePositionOffset = byteSize * 0 // cubeVertexArray内の頂点座標のオフセットの位置
export const cubeColorOffset = byteSize * 4 // cubeVertexArray内のカラー値のオフセットの位置
export const cubeVertexCount = 36

export const uniformBufferSize = byteSize /* bytes */ * 16 * 3 // 4x4 matrix * 3

// prettier-ignore
export const cubeVertexArray = new Float32Array([
  // position[x, y, z, _], color(r,g,b,a)
  1, -1, 1, 1,   1, 0, 1, 1,
  -1, -1, 1, 1,  0, 0, 1, 1,
  -1, -1, -1, 1, 0, 0, 0, 1,
  1, -1, -1, 1,  1, 0, 0, 1,
	1, -1, 1, 1,   1, 0, 1, 1,
  -1, -1, -1, 1, 0, 0, 0, 1,

  1, 1, 1, 1,    1, 1, 1, 1,
  1, -1, 1, 1,   1, 0, 1, 1,
  1, -1, -1, 1,  1, 0, 0, 1,
  1, 1, -1, 1,   1, 1, 0, 1,
  1, 1, 1, 1,    1, 1, 1, 1,
  1, -1, -1, 1,  1, 0, 0, 1,

  -1, 1, 1, 1,   0, 1, 1, 1,
  1, 1, 1, 1,    1, 1, 1, 1,
  1, 1, -1, 1,   1, 1, 0, 1,
  -1, 1, -1, 1,  0, 1, 0, 1,
  -1, 1, 1, 1,   0, 1, 1, 1,
  1, 1, -1, 1,   1, 1, 0, 1,

  -1, -1, 1, 1,  0, 0, 1, 1,
  -1, 1, 1, 1,   0, 1, 1, 1,
  -1, 1, -1, 1,  0, 1, 0, 1,
  -1, -1, -1, 1, 0, 0, 0, 1,
  -1, -1, 1, 1,  0, 0, 1, 1,
  -1, 1, -1, 1,  0, 1, 0, 1,

  1, 1, 1, 1,    1, 1, 1, 1,
  -1, 1, 1, 1,   0, 1, 1, 1,
  -1, -1, 1, 1,  0, 0, 1, 1,
  -1, -1, 1, 1,  0, 0, 1, 1,
  1, -1, 1, 1,   1, 0, 1, 1,
  1, 1, 1, 1,    1, 1, 1, 1,

  1, -1, -1, 1,  1, 0, 0, 1,
  -1, -1, -1, 1, 0, 0, 0, 1,
  -1, 1, -1, 1,  0, 1, 0, 1,
  1, 1, -1, 1,   1, 1, 0, 1,
  1, -1, -1, 1,  1, 0, 0, 1,
  -1, 1, -1, 1,  0, 1, 0, 1,
]);
